ArtMoney Plugin
8.17
Traducido por
Moisés R. González Rodríguez
morasoft2@yahoo.es
Acerca de...
Ayudas para Juegos
<d> de <ms> de <yyyy>//formato de fecha
Copyright (C) 1996-2020, System SoftLab
Email para comentarios,
sugerencias, bugs...
Por favor, visite la Web de Artmoney para obtener la última versión
Valor
Buscar
Filtrar
Número de referencia
Primero seleccione el juego a procesar
Búsqueda en proceso
Números encontrados en el filtrado
Lo siento, no se ha encontrado nada. Pruebe otra vez.
Inactivo
Hallados 
números
números
número
En lista 
Error de carga
Error en la busca
Error de filtrado
Formato de archivo no soportado
Número inexistente para ese tipo
No se puede cargar
Proceso de búsqueda
Proceso de filtrado
Todo lo posible 
byte
byte
bytes
Metodo no válido. Pruebe otro.
seg
min
No ha seleccionado el método para este tipo.
No hay más de ese tipo.
Cambiado
Sin cambiar
Aumentado
Disminuido
Tabla creada por nueva versión
Tabla defectuosa
Error de acceso al archivo
Entero 1 byte
Entero 2 bytes
Entero 3 bytes
Entero 4 bytes
Entero 8 bytes
Flotante 4 bytes
Flotante 6 bytes
Flotante 8 bytes
Flotante 10 bytes
Texto
Secuencia terminada nula
Secuencia nula
Secuencia Pascal
R.Entero 2 bytes
R.Entero 3 bytes
R.Entero 4 bytes
R.Entero 8 bytes
R.Flotante 4 bytes
R.Flotante 6 bytes
R.Flotante 8 bytes
R.Flotante 10 bytes
R.Texto
R.Secuencia nula
R.Secuencia Pascal
Enero
Febrero
Marzo
Abril
Mayo
Junio
Julio
Agosto
Septiembre
Octubre
Noviembre
Diciembre
F
Ayuda
Acerca de...
Seleccione proceso
Borrar
Cargar
Guardar
Agregar
Agregar todo
Editar
Copiar
Borrar
Marcar
No marcar
Auto-actualizar
Información
Tipo de juego
Actualiz. direcciones (ms)
Actualiz. pantalla (ms)
Lenguaje
Mostrar direcciones
Tecla rápida
General
Adicional
Personal
Email:
Comentario:
Sistema operativo
Formato decimal
Orden de Bytes
Prioridad para buscar
Alta
Máxima
Opciones
Anular
Normal
Editar dirección
Marcar
Tamaño
Dirección
Descripción
Tipo
Inverso
Valor exacto
Secuencia básica
Rango básico
Valor desconicido
Valor codificado
Especificar
Elija tipo
Orden de bytes
Normal e inverso
Todo
Entero
Flotante
Tiempo transcurrido:
Tiempo restante:
Velocidad:
Encontrados:
Juego:
Comentario:
Fecha:
Sistema:
Tabla informativa
Creador
Nombre:
Lugar:
Datos de la secuencia
Fijar tecla rápida
Inverso
Buscar en este bloque de memoria
Buscar en este rango
Ahorrar espacio de disco
desde
a
Buscar
Filtrar
Paso
Paso//Fijar valor
Fijar valor
Seleccionar todo
AUTO
Mostrar procesos
visible
Con ventanas
Información del proceso
Fin del proceso
Mostrar ventana
Ocultar ventana
¿Seguro qué quiere terminar el proceso?
Acceso denegado
Imposible terminar el proceso
Archivo:
Tipo de proceso
Tamaño de los datos
Prueba Patrón
Prueba patrón para medir la velocidad de la exploración de la memoria 
Espere
Su sistema
Teclas Especiales
Añadir al valor
Bloquear esta ventana
"Deshacer/Rehacer filtrado" activo
Ver enteros
sin marcar
marcado
Deshacer el filtrado
Rehacer el filtrado
Guardar el filtrado
Cargar el filtrado
El paso actual es:
"Deshacer el filtrado" inactivo
"Rehacer el filtrado" inactivo
"Cargar el filtrado" inactivo
aumentando en
disminuyendo en
Interfaz
Tecla rápida
Tecla rápida activa
Tecla rápida predeterminada
Fuente del menú
Fuente de las tablas
Color de barras y menú
Color de fondo
Color de botones
Botones elípticos
OK
Editor de memoria
Ver en hexadecimal
Editar en hexadecimal
Número de columnas
Ver elemento
Elemento actual
Indagar
en resultados de búsqueda
en tabla
en bloque de memoria
en la dirección
Primero
Anterior
Siguiente
Último
Total
Actual
Copiar el área
Insertar el área
Añadir a la tabla
Todo (estandar)
Entero (estandar)
Flotante (estandar)
Invertir selección
Alinear columnas
<NO>
Indicador
Actualizar
Editar lo seleccionado
Grupo
Grupo visible
Seleccionar grupo
Guardar esta dirección/indicador
Auto-aplicar los cambios a todo
Auto-aplicar los cambios al grupo
Auto-aplicar los cambios de guardar dirección a todo
Auto-aplicar los cambios de guardar dirección al grupo
Comandos con indicadores
Poner el indicador a todo
Poner el indicador al grupo
Guardar el indicador con todo
Guardar el indicador con grupo
Poner el indicador a esta dirección
Poner el indicador al guardar dirección
Buscar el indicador en esta dirección
Buscar el indicador desde inicio del bloque de memoria
Ordenar
Ordenar por descripción
Ordenar por dirección
Ordenar por valor
Ordenar por texto
Ordenar por grupo
Fusionar
Error al fusionar
Ambas tablas deben ser creadas por el mismo autor
Seleccionar proceso actual
Conjunto de caracteres
Mostrar panel de grupo visible
en grupo
Convertir indicadores a direcciones
Establecer filtrado
Secuencia
<Archivo no encontrado>
<Acceso denegado>
Editor de Archivo
Errores
<Tamaño cambiado>
Apariencia
Ninguna
Editar fuente
Color de tabla
Guardar descarga de memoria
Por fórmula
Proceso
Detener proceso
Continuar proceso
Guardar proceso
Cargar proceso
ID del proceso
Tareas
Archivo(s)
Información de archivo(s)
Seleccionar archivo
Seleccionar carpeta
Número de archivo(s)
Tamaño total
Moverse por carpeta
Objeto
Tabla
Salir
Resultado
Más
Comprar "ArtMoney Pro" on-line
Visitar Página Web
Manual de ArtMoney
Codificación
Elegir codificación
Brillo
Tonalidad
Mostrar menú principal
No usar plugins oficiciales de lenguaje
Parar procesos durante la búsqueda
Guardar/Cargar valores en el archivo-tabla
Librería para visor de procesos
Opciones de carpeta
Archivos del tipo
Tiempo de modificación
Fecha del archivo
Hora del archivo
No marcar
Últimos 15 min
Última hora
Último día
Último mes
Último año
Más de
Menos de
Esta característica sólo está disponible en la Edición PRO
Sólo en ArtMoney Pro
Acuerdo de Licencia
Estoy de acuerdo con los términos y condiciones de este Acuerdo de Licencia
Acerca de la Edición PRO
Agradecimiento especial
Por Diseño y Manual de Usuario
Por Logo
Por Módulo de Instalación
Por Creación de Iconos
Por Corrección Gramatical del Manual en Inglés
Por Ayudas
Por Apariencias (paquete ThemeEngine)
Por Consejos y Observaciones
Por Traducciones
Por Tablas
Número de registro
No Registrado
No preguntar el Password otra vez
Sólo para usuario actual de Windows 
Detener procesos y Popup
Cambiar y continuar procesos
No necesita paréntesis
Necesario paréntesis
No necesita comillas
ID Incorrecto
Número incorrecto de argumentos (M1,M2...)
Número incorrecto de operaciones (-,+)
Número incorrecto de condiciones (<,>,=)
Número incorrecto de expresiones
Expresión incorrecta
Este paso no existe
Condición incorrecta
Parámetro incorrecto para
Sin condiciones
Buscando
Registro
Password
Por favor ponga el password y presione "OK"
Password incorrecto
Código incorrecto
No hay código
Por defecto
Cancelado por el usuario
El manual
Proceso no encontrado
Restaurar los valores de la tabla sólo con la forma central
Tamaño de código
Mapa de proceso
Dirección de región
Estado
Proteger región
Proteger
Nombre del módulo
Esta característica sólo funciona en Windows 2000/XP/2003/VISTA/2008/7/8/2012/10
Guardado/Cargado de procesos
Modo
Proceso no válido. El proceso fue cambiado o recomenzado.
Cerrar
En Excel
Redondear valor flotante
Macromedia Flash
Rango
Mantener el proceso en memoria
Tamaño reservado de memoria física
Iniciar nuevo proceso
Instalar
Crear acceso directo en el Escritorio
Ocultar el proceso
Mostrar el proceso
Emulador
Sistema de Juego
Rango de direccion
Usar opciones del Emulador
Mapa de memoria del Emulador
direcc. Emul.
direcc. PC
¿Quieres convertir direccion del Emulador a PC?
¿Quieres convertir direccion del PC a Emulador?
Error convirtiendo direccion
Autodetectar emulator por nombre de archivo
Grupos
Mostrar árbol de grupos
Nada
Izquierda
Derecha
Nuevo Grupo
Menú
Lenguaje
¿Quieres borrar este lenguaje?
¿Quieres agregar este lenguaje?
¿Quieres cambiar el nombre del lenguaje?
normal freeze
puede aumentar
puede disminuir
de mínimo a máximo
Mínimo
Máximo
Copiar seleccionado
Descargar el programa "Spyware Process Detector"
“Spyware Process Detector” no se encuentra en su ordenador. Puede descargarlo e instalarlo desde nuestra página www.systemsoftlab.com. El programa puede trabajar junto con ArtMoney como selector de procesos. Usando “Spyware Process Detector”, puedes abrir cualquier proceso oculto y un proceso que bloquee la apertura. El programa muestra información detallada sobre los procesos que funcionan en su PC y detecta nuevos spywares, troyanos y virus. (indetectables por su programa anti-virus).
Enviar sugerencias o reporte de errores
Visitar nuestra página Web y descargar otros programas
Esta es una versión GRATUITA. Puede comprar la versión completa por 19.90 EURO. Sólo se paga una vez, ¡las actualizaciones son gratutas!
Sólo los usuarios registrados recibirán completo soporte técnico y podrán usar todas las opciones extra.
Para pagar, asegúrese que está conectado a internet y teclee en el botón de registrar ahora On-line.
Registrar Online ahora
Servicio de instalación
Windows necesita autentificar el usuario para instalar el servicio.
Instalar como el usuario:
Nombre usuario
Dominio
Error en la instalación. Acceso denegado.
Fallo en la conexión
Modo silencioso
Ocultar mi proceso
Ocultar mi ventana
Versión antigua instalada. Por favor, reinicie el ordenador para instalar la nueva versión.
Esta tabla ha cambiado.
¿Quiere guardar los cambios?
Preguntar por guardar la tabla con cambios sin guardar antes de salir.
Estructura
Saltado
Campo
El tamaño de la estructura no puede ser mayor de 
Item
Nuevo Item
Buscar en la estructura de la tabla
Buscar en la estructura del grupo
Buscar en la estructura de la dirección elegida
Subir
Bajar
Consigue "ArtMoney Pro" gratis
Para el control gramatical del manual Ruso
Tipo de redondeo
Al más cercano
Por arriba
Por abajo
A cero
Continuar
Conseguirlo gratis
Desensamblar
Instrucción de ensamblado
Direccionamiento de módulo
Módulo
Dirección en módulo
Error de conversión
No puedo convertir la dirección de módulo: No existe módulo en este proceso.
Explorar módulos de sistema de área de memoria 
Explorar módulos compartidos de área de memoria
Abrir procesos de error
Imposible abrir este proceso.
Prueba a usar la versión PRO.
Necesitas la versión PRo para esta tabla
Registro no válido
Dirección no válida
Valor no válido
El valor es demasiado grande
Direccion ensamblador no válida
Por favor teclea con el botón derecho sobre la aplicación y ejecuta como Administrador desde el menú contextual.
Error al iniciar
Error al abrir
Intente reiniciar el ordenador
fue cambiado por
Tabla de conversión
¿Quieres convertir tu tabla a modo 64-bit?
¿Quieres convertir tu tabla a modo 32-bit?
Ocurrio un error de conversión. El programa no puede convertir la dirección a modo 32-bit.
Multiplicidad de dirección//Dirección divisibilidad
Par//Divisibilidad por 2
Impar
Múltiplo de 4//Divisibilidad por 4
Múltiplo de 8//Divisibilidad por 8
Múltiplo de 16//Divisibilidad por 16
Analizar sólo las direcciones estáticas en los módulos
Visualizar módulo de opciones
Introduce el código de registro
Por favor, pegue su código de registro (puede utilizar las teclas Ctrl-V o el botón "Pegar" ), luego haga clic en "Aceptar"
Pegar
El código de registro no es válido
El código de registro es sólo válido para la versión en Inglés
El código de registro es sólo válido para la versión en Ruso
El código de registro es sólo válid para una versión más antigua
El código de registro ya no funciona. Por favor contacte con sales@systemsoftlab.com para obtener un nuevo código de registro.
¡Si no aparece su nombre y sus datos aquí, entonces está utilizando una versión crackeada o pirateada, por tanto, esta versión puede funcionar incorrectamente!
Puntero a Puntero
Desplazamiento máximo
Nivel de
Buscar de puntero a puntero
¡Máximo 2 niveles para SE edition!
Trata de desactivar el Sistema de Validación de Firmas
Modo más rápido (utiliza más memoria)
Mb
Aplicar automáticamente la compensación y copiar a un nuevo grupo
Dirección en el bloque
No puedo convertir direcciones en el bloque: No existe el bloque en el proceso.
Problema de conversión: Tamaño de bloque no es único.
Ordenar los punteros por compensación
Ocultar el texto para modo silencioso / Sólo VIP
Comprar o vender cuentas de juegos en línea
Nueva versión disponible para descargar
Comprobar si hay nuevas versiones
Puntero con desplazamiento
Buscar el puntero con el desplazamiento disponioble máximo
Disponible desde 2 pasos
Formula
Versión
Siempre arriba
Activar "siempre arriba"
Desactivar "Siempre arriba"
Compruebe su conexión a Internet, No se puede acceder a systemsoftlab.com
Intenta establecer la opción
Nombre/Módulo
Código Hexadecimal
Registro
Marca
Añadir el depurador
Separar el depurador
¿Quieres añadir el depurador al proceso seleccionado??
Lista de puntos de interrupción
Comandos
Depurar
Guardar información depurada
Cargar información depurada
Lenguaje ensamblador
x86-32 bits
x86-64 bits
Pubto de interrupción
Añadir punto de interrupción
Quitar punto de interrupción
Ejecutar
Ejecutar hasta
Hata el regreso
Rastrear paso
Rastrear paso sobre
Establecer nombre de dirección
Remover nombre de dirección
Sí
No
Tipo de depurador
Estandard
Manejo de excepciones
Tipo de puntos de corte ejecutable
Software (int3 instrucciones)
int3
Registros de depuración (máx 4)
registro
Página de excepciones
excepciones
Acceso al tipo de punto de interrupción
Preguntar para adjuntar depurador al proceso
Usar los puntos de interrupción del software si están utlilizados todos los registros de depuración
Auto Guardar/Cargar información de depuración
Usar símbolo de depuración
Ruta del símbolo
Activo
Interrumpir
Ejecutar
Cualquier acceso
Escribir
Condiciones
Cambios
Activar todo
Desacticar todo
Encontrar una instrucción que está accediendo a la dirección
En acceso a memoria
En escritura de memoria
Error en condiciones
Error en cambios
Divide por cero
Error de lectura
Error de escritura
Lado izquierdo erróneo
Iniciar
Parar
Acceder
Borrar resultados
Divide por tareas
Número
Tarea
8-bits
16-bits
32-bits
Hex
Hex
Float4
Float8
Secuencia Hexadecimal
El servidors de systemsoflab.com no responde o no hay conexión a Internet
El código de registro no es correcto
Puedes activar este código sólo dos veces al día
El código de registro es solo válido para la edición VIP
Ocultar el depurador presente
Guardar la tabla en unicode
Obtener tamaño hasta el final de la función (hasta el regreso)
Licencias
Scan memory regions
data writable
data readonly
code writable
code readonly
shared
system
guarded
hidden
Multiplicity of each address
Address names and symbols list
Folder symbols
User names
Case sensitive
Whole words
First position
Read/Write
Auto detect size of functions
Hide debug registers
Patch this functions (structures)
Saltar protección de proceso
Usar funciones propias para acceder a memoria
User mode functions (attach to the process)
Kernel mode functions (via driver)
Attach to the process without OpenProcess
Signatures
Signature search
Add signature
Offset
Auto search
Static adress
Regions
Edit as the assembly code
As assembly code
Convert to HEX
Limit unique offsets per level
Code replacing
Replace the code
Replace all codes simultaneously
<REPLACED>
<NOT REPLACED>
<NO MODULE>
<NO BLOCK>
<NO SIGNATURE>
<NO VARIABLE>
Code injecting
Inject the code
Only after successed code replacing
Automatically replace all codes and inject
Allow to automatically replace all codes and inject
Ask for permission to automatically replace all codes and inject
The table contains a code for injection and replacement. It can be malicious code! Download tables only from most trusted websites! Do you want to inject the code in the process?
Replace all codes and inject
Cancel code replacing and injecting
Signature
Original Signature
Wrong original signature
Address of signature//full
Address of sign.//short
Address of variable/label//full
Address of variable//short
I can not convert the address of signature: No such signature.
I can not convert the address of variable: No such variable.
Name//variable or label
Code size for replacing 
One assembler instruction
Several assembler instructions
Line
Relative addressing error (offset is too big)
Invalid multiplier
Back jmp error
Cannot allocate memory
Areas//Memory areas
Set mirror address
Clear mirror address
from the minimum address
Service
Show pointer offsets in hexadecimal
Use RAX(EAX) register. Only MOV instruction with RAX(EAX) register can read/write an absolute address!
Change process speed
Your speed (%)
Normal//Speedd
Change process speed error
Increase process speed
Decrease process speed
Stack
View as stack
Save thread stack
Return adress
Parameter
Parameters
Show parameters in one line
Return address only in module
Read Memory Error
Digits after a decimal point (Fractional part)//full
Digits a.//short
Masks
Read mask
Write mask
Use mask type
<MASK ERROR>
Server sent an invalid response or bad internet connection
stacks
Use stack of the threads as module name
Limit the number of threads
Stack of thread
64-bit stack of thread
Temp files folder
Current user folder
Program folder
Another folder
Temp folder error
Temp folder does not exist and could not be created
Last digits
D7B7A062